# Module 1 - Introduction to Pandas
## Pandas Part 1

### Introduction

![austin](http://www.austintexas.gov/sites/default/files/aac_logo.jpg)
You have decided that you want to start your own animal shelter, but you want to get an idea of what that will entail and get more information about planning. You have found out that Austin has one of the largest no-kill animal shelters in the country, and they keep meticulous track of animals that have been taken in and released. However, it is a large file, the online visualization tools provided are terrible, the data is sorted as strings, and the file holds an overwhelming amount  of information. Is there an easy way to look at this data? Can we do this with base Python? Is there a better way?


#### _Our goals today are to be able to_: <br/>

- Import/read data using Pandas
- Identify Pandas objects and manipulate Pandas objects by index and columns
- Filter data using Pandas

#### _Big questions for this lesson_: <br/>
- Why use Pandas? 
 
 (a) Provides methods able analyze data stored in the format Data Scientist most often encounter (.csv, .tsv, or .xlsx). 
 
 (b) Makes it very convenient to load, process, and analyze in the aforementioned formats. 
 
 (c) Along with python visualization packages allows for the visual analysis of tabular data.
 

- When do we want to use NumPy versus Pandas?
- What are the advantages of using Pandas?    
https://stackabuse.com/beginners-tutorial-on-the-pandas-python-library/
- What are the disadvantages of using Pandas?                      
https://wesmckinney.com/blog/apache-arrow-pandas-internals/

- The data structures in Pandas are implemented using series and dataframe classes.  
- A series is a one-dimensional indexed array of some fixed data type.  
- While a dataframe is a two-dimensional data structure like a table where each column contains data of the same type.  
- DataFrames are great for representing real data: rows correspond to instances (examples, observations, etc.), and columns correspond to features of these instances.

### Activation:

<img src="https://cdn-images-1.medium.com/max/1600/1*9IU5fBzJisilYjRAi-f55Q.png" width=700, height=700>  




- The data manipulation capabilities of Pandas are built on top of the numpy library.
- Pandas dataframe object represents a spreadsheet with cell values, column names, and row index labels.

### 1. Importing and reading data with Pandas!

#### Let's use pandas to read some csv files so we can interact with them.

In [2]:
# First, let's check which directory we are in so the files we expect to see are there.
!pwd
!ls -la data

/Users/maxtingle/fis/dc-ds-08-26-19/module-1/week-1/day-5-pandas-1
total 16
drwxr-xr-x  4 maxtingle  staff  128 Aug 30 10:33 .
drwxr-xr-x  5 maxtingle  staff  160 Aug 30 10:34 ..
-rw-r--r--  1 maxtingle  staff   62 Aug 30 10:33 example1.csv
-rw-r--r--  1 maxtingle  staff  238 Aug 30 10:33 made_up_jobs.csv

In [3]:
import pandas as pd

example_csv = pd.read_csv('data/example1.csv')

There is also `read_excel`, `read_html`, and many other pandas `read_` functions.  
http://pandas.pydata.org/pandas-docs/stable/user_guide/io.html

In [4]:
example_csv.head()

     Title1    Title2    Title3
0       one       two     three
1  example1  example2  example3

In [5]:
!head data/example1.csv
#original data view in Terminal

Title1,Title2,Title3
one,two,three
example1,example2,example3

Try loading in the example file in the `data` directory called `made_up_jobs.csv` using pandas.

In [6]:
#read in your csv here!

jobs_csv = pd.read_csv('data/made_up_jobs.csv')
#remember that it's nice to be able to look at your data, so let's do that here, too.

In [7]:
jobs_csv.head()

   ID           Name                       Job  Years Employed
0   0   Bob Bobberty  Underwater Basket Weaver              13
1   1   Susan Smells             Salad Spinner               5
2   2  Alex Lastname      Productivity Manager               2
3   3        Rudy P.                Being cool              55
4   4        Rudy G.  Being compared to Rudy P              50

In [8]:
jobs_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
ID                6 non-null int64
Name              6 non-null object
Job               6 non-null object
Years Employed    6 non-null int64
dtypes: int64(2), object(2)
memory usage: 272.0+ bytes

In [9]:
jobs_csv.tail()

   ID            Name                       Job  Years Employed
1   1    Susan Smells             Salad Spinner               5
2   2   Alex Lastname      Productivity Manager               2
3   3         Rudy P.                Being cool              55
4   4         Rudy G.  Being compared to Rudy P              50
5   5  Sir Wellington            Cheese Stacker              10

In [10]:
print(len(jobs_csv))

6

You can also load in data by using the url of an associated dataset.

In [11]:
shelter_data = pd.read_csv('https://data.austintexas.gov/api/views/9t4d-g238/rows.csv?accessType=DOWNLOAD')
# this link is copied directly from the download option for CSV

shelter_data.head()

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
0,A790578,*Tux,08/30/2019 08:00:00 AM,08/30/2019 08:00:00 AM,09/12/2017,Adoption,Foster,Dog,Neutered Male,1 year,Boxer/Pointer,Black/White
1,A798506,*Drake,08/30/2019 07:26:00 AM,08/30/2019 07:26:00 AM,06/16/2019,Adoption,Foster,Dog,Neutered Male,2 months,Labrador Retriever/Bearded Collie,Black/White
2,A798504,*Travis,08/30/2019 06:53:00 AM,08/30/2019 06:53:00 AM,06/16/2019,Adoption,Foster,Dog,Neutered Male,2 months,Labrador Retriever/Bearded Collie,Black/Brown
3,A798503,*Annie,08/30/2019 06:50:00 AM,08/30/2019 06:50:00 AM,06/16/2019,Adoption,Foster,Dog,Spayed Female,2 months,Labrador Retriever/Bearded Collie,Black/Brown
4,A798500,*Monroe,08/30/2019 06:45:00 AM,08/30/2019 06:45:00 AM,06/16/2019,Adoption,Foster,Dog,Spayed Female,2 months,Labrador Retriever/Bearded Collie,Tricolor/White

Now that we can read in data, let's get more comfortable with our Pandas data structures.

In [12]:
type(shelter_data)

pandas.core.frame.DataFrame

In [13]:
# Now that data is read let's look at it's shape
print(shelter_data.shape)

(106877, 12)

In [21]:
#index the shape so you can call on row / column totals in later operations
print(shelter_data.shape[0])

106877

In [17]:
shelter_data.size

1282524

In [14]:
# What are the names of the columns
print(shelter_data.columns)

Index(['Animal ID', 'Name', 'DateTime', 'MonthYear', 'Date of Birth',
       'Outcome Type', 'Outcome Subtype', 'Animal Type', 'Sex upon Outcome',
       'Age upon Outcome', 'Breed', 'Color'],
      dtype='object')

In [22]:
list(shelter_data.columns)

['Animal ID',
 'Name',
 'DateTime',
 'MonthYear',
 'Date of Birth',
 'Outcome Type',
 'Outcome Subtype',
 'Animal Type',
 'Sex upon Outcome',
 'Age upon Outcome',
 'Breed',
 'Color']

In [15]:
# What are the different data types present in our data
print(shelter_data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 106877 entries, 0 to 106876
Data columns (total 12 columns):
Animal ID           106877 non-null object
Name                73287 non-null object
DateTime            106877 non-null object
MonthYear           106877 non-null object
Date of Birth       106877 non-null object
Outcome Type        106870 non-null object
Outcome Subtype     48695 non-null object
Animal Type         106877 non-null object
Sex upon Outcome    106874 non-null object
Age upon Outcome    106865 non-null object
Breed               106877 non-null object
Color               106877 non-null object
dtypes: object(12)
memory usage: 9.8+ MB
None

In [16]:
# We can find the type of a particular columns in a data frame in this way.
ID_series = shelter_data['Animal ID']
shelter_data['Animal ID'].dtypes

dtype('O')

In [23]:
type(ID_series)

pandas.core.series.Series

In [24]:
type(ID_series.values)

numpy.ndarray

In [26]:
shelter_data["Name"]

0              *Tux
1            *Drake
2           *Travis
3            *Annie
4           *Monroe
5             *Mary
6              *Eva
7              Blue
8              Cali
9             Loppy
10              Ami
11              Leo
12          *Bandit
13              NaN
14             Ruby
15           *Bunny
16             Bear
17              NaN
18              NaN
19            Opien
20           Ramona
21              NaN
22              NaN
23            Sadie
24             Lina
25              NaN
26              NaN
27              NaN
28              NaN
29           Austin
            ...
106847        Hooch
106848          NaN
106849         Buck
106850          NaN
106851       Knight
106852          NaN
106853          NaN
106854          NaN
106855          NaN
106856          NaN
106857          NaN
106858      Pikachu
106859          NaN
106860        Beast
106861       Claire
106862       Sylvio
106863        *Gage
106864          Lou
106865         Deco
106866         Jake
106867       Blakie
106868    Baby Girl
106869      *Starla
106870          NaN
106871          NaN
106872         Moby
106873          NaN
106874          NaN
106875          NaN
106876      *Dudley
Name: Name, Length: 106877, dtype: object

In [27]:
shelter_data.Name

0              *Tux
1            *Drake
2           *Travis
3            *Annie
4           *Monroe
5             *Mary
6              *Eva
7              Blue
8              Cali
9             Loppy
10              Ami
11              Leo
12          *Bandit
13              NaN
14             Ruby
15           *Bunny
16             Bear
17              NaN
18              NaN
19            Opien
20           Ramona
21              NaN
22              NaN
23            Sadie
24             Lina
25              NaN
26              NaN
27              NaN
28              NaN
29           Austin
            ...
106847        Hooch
106848          NaN
106849         Buck
106850          NaN
106851       Knight
106852          NaN
106853          NaN
106854          NaN
106855          NaN
106856          NaN
106857          NaN
106858      Pikachu
106859          NaN
106860        Beast
106861       Claire
106862       Sylvio
106863        *Gage
106864          Lou
106865         Deco
106866         Jake
106867       Blakie
106868    Baby Girl
106869      *Starla
106870          NaN
106871          NaN
106872         Moby
106873          NaN
106874          NaN
106875          NaN
106876      *Dudley
Name: Name, Length: 106877, dtype: object

In [28]:
shelter_data.columns

Index(['Animal ID', 'Name', 'DateTime', 'MonthYear', 'Date of Birth',
       'Outcome Type', 'Outcome Subtype', 'Animal Type', 'Sex upon Outcome',
       'Age upon Outcome', 'Breed', 'Color'],
      dtype='object')

In [29]:
#delete spaces in column names
shelter_data.columns = [x.replace(" ", "") for x in shelter_data.columns]

In [31]:
shelter_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 106877 entries, 0 to 106876
Data columns (total 12 columns):
AnimalID          106877 non-null object
Name              73287 non-null object
DateTime          106877 non-null object
MonthYear         106877 non-null object
DateofBirth       106877 non-null object
OutcomeType       106870 non-null object
OutcomeSubtype    48695 non-null object
AnimalType        106877 non-null object
SexuponOutcome    106874 non-null object
AgeuponOutcome    106865 non-null object
Breed             106877 non-null object
Color             106877 non-null object
dtypes: object(12)
memory usage: 9.8+ MB

In [32]:
shelter_data.AnimalID

0         A790578
1         A798506
2         A798504
3         A798503
4         A798500
5         A798502
6         A798499
7         A803079
8         A803077
9         A803095
10        A803110
11        A802958
12        A802872
13        A802881
14        A578861
15        A801437
16        A802606
17        A802679
18        A798430
19        A768899
20        A802833
21        A802884
22        A803224
23        A733193
24        A802893
25        A802964
26        A802946
27        A802948
28        A802947
29        A802491
           ...
106847    A663887
106848    A663935
106849    A663201
106850    A663955
106851    A664171
106852    A663938
106853    A664261
106854    A664260
106855    A664262
106856    A664263
106857    A664271
106858    A663495
106859    A664219
106860    A613553
106861    A648744
106862    A664258
106863    A663546
106864    A664225
106865    A663342
106866    A656894
106867    A661795
106868    A663833
106869    A663572
106870    A663888
106871    A663646
106872    A664223
106873    A664236
106874    A664237
106875    A664235
106876    A659834
Name: AnimalID, Length: 106877, dtype: object

### 2. Utilizing and identifying Pandas objects

- What is a DataFrame object and what is a Series object? 
- How are they different from Python lists?

These are questions we will cover in this section. To start, let's start with this list of fruits.

In [33]:
fruits = ['Apple', 'Orange', 'Watermelon', 'Lemon', 'Mango']

print(fruits)

['Apple', 'Orange', 'Watermelon', 'Lemon', 'Mango']

Using our list of fruits, we can create a pandas object called a 'series' which is much like an array or a vector.

In [34]:
fruits_series = pd.Series(fruits)

print(fruits_series)
type(fruits_series)

0         Apple
1        Orange
2    Watermelon
3         Lemon
4         Mango
dtype: object

pandas.core.series.Series

One difference between python **list objects** and pandas **series objects** is the fact that you can define the index manually for a **series objects**.

In [35]:
ind = ['a', 'b', 'c', 'd', 'e']

fruits_series = pd.Series(fruits, index=ind)

print(fruits_series)

a         Apple
b        Orange
c    Watermelon
d         Lemon
e         Mango
dtype: object

In [36]:
fruits_series.index = ['a', 'b', 'c', 'd', 'e']
fruits_series

a         Apple
b        Orange
c    Watermelon
d         Lemon
e         Mango
dtype: object

With a partner, create your own custom series from a list of lists.

In [38]:
list_of_lists = [['cat'], ['dog'], ['horse'], ['cow'], ['macaw']]

# create custom indices for your series
ind = ['a', 'b', 'c', 'd', 'e']

# create the series using your list objects
# You can use either a for loop or also pd.Series
list_of_lists_series = pd.Series(list_of_lists, index=ind)

# print your series
print(list_of_lists_series)
type(list_of_lists_series)

a      [cat]
b      [dog]
c    [horse]
d      [cow]
e    [macaw]
dtype: object

pandas.core.series.Series

We can do a simliar thing with Python dictionaries. This time, however, we will create a DataFrame object from a python dictionary.

In [50]:
# Dictionary with list object in values
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante'],
    'age': ['35', '17', '26'],
    'city': ['Houston', 'Seattle', 'New york']
}

students_df = pd.DataFrame(student_dict)

students_df.head()

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [40]:
#to find data types of columns
students_df.dtypes

name    object
age     object
city    object
dtype: object

In [41]:
# List with dictionary objects in values
student_dict = [
    {'name': 'Sam', 'age': '35', 'city': 'houston'},
    {'name': 'max', 'age': '25', 'city': 'dallas'},
]  

students_df = pd.DataFrame(student_dict)

students_df.head()

  age     city name
0  35  houston  Sam
1  25   dallas  max

In [42]:
students_df.age

0    35
1    25
Name: age, dtype: object

Let's change the data type of ages to float.

In [46]:
# We can also change a columns type but the change has to make sense.
students_df.age = students_df.age.astype(float)

#Uncomment line below and observe what happens when trying to convert student's name to int or float
#students_df.name = students_df.name.astype(int)
#won't work

#How about what happens converting numeric to string
#students_df.age = students_df.age.astype(str)
#will work and to change back to int, have to cast as float, then cast as string

students_df.dtypes

age     float64
city     object
name     object
dtype: object

In [47]:
students_df.astype({'age': float})

    age     city name
0  35.0  houston  Sam
1  25.0   dallas  max

In [48]:
#making it all string data
students_df.astype(str).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
age     2 non-null object
city    2 non-null object
name    2 non-null object
dtypes: object(3)
memory usage: 128.0+ bytes

We can also use a custom index for these items. For example, we might want them to be the individual student ID numbers.

In [51]:
school_ids = ['1111', '1145', '0096']

# Notice here we use pd.DataFrame not pd.Series as we did for a pandas series.
students_df = pd.DataFrame(student_dict, index=school_ids)

students_df.head()

          name age      city
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

Using Pandas, we can also rename column names.

In [52]:
students_df.columns = ['NAME', 'AGE', 'HOME']
students_df.head()

          NAME AGE      HOME
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

Or, we can also change the column names using the rename function.

In [53]:
students_df.rename(columns={'AGE': 'YEARS'})

          NAME YEARS      HOME
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

In [54]:
# Notice what happens when we print students_df

students_df

          NAME AGE      HOME
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

In [55]:
# If you want the file to save over itself, use the option `inplace = True`.
students_df.rename(columns={'AGE': 'YEARS'}, inplace=True)
students_df.head()

          NAME YEARS      HOME
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

Similarly, there is a tool to remove rows and columns from your DataFrame

In [58]:
students_df.drop(columns=['YEARS', 'HOME'], axis=1)

          NAME
1111  Samantha
1145      Alex
0096     Dante

In [59]:
#Notice again what happens if we print students_df 
students_df

          NAME YEARS      HOME
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

In [60]:
students_df.drop(['YEARS', 'HOME'], inplace=True, axis=1)
students_df

          NAME
1111  Samantha
1145      Alex
0096     Dante

If you want the file to save over itself, use the option `inplace = True`.

Every function has options. Let's read more about `drop` [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html)

### 3. Filtering Data Using Pandas
There are several ways to grab particular data from a DataFrame. 
- Python lists allow for selection of data only through integer location. 
- You can use a single integer or slice notation to make the selection but NOT a list of integers.
- Dictionaries only allow selection with a single label. Slices and lists of labels are not allowed.

In [61]:
#can't get multiple things out of a list
l = [1, 2, 3, 4, 5]
l[[0, 5]]

TypeError: list indices must be integers or slices, not list

### DataFrames can be indexed by column name (label) or row name (index) or by position.   
#### The `.loc` method is used for indexing by name.  
#### While `.iloc` is used for indexing by number.

In [62]:
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante'],
    'age': ['35', '17', '26'],
    'city': ['Houston', 'Seattle', 'New york']
}

students_df = pd.DataFrame(student_dict)

In [63]:
students_df

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

### Let's take a look at `.iloc`
#### `.iloc` takes slices based on index position.
#### `.iloc` stands for integer location so that should help with remember what it does
#### `.iloc`[row , column]

In [66]:
# returns the first row
students_df.iloc[0, :]

name    Samantha
age           35
city     Houston
Name: 0, dtype: object

In [67]:
# returns the first column
students_df.iloc[:, 0]

0    Samantha
1        Alex
2       Dante
Name: name, dtype: object

In [68]:
# returns first two rows notice that ILOC performs regular python slicing.
students_df.iloc[0:2]

       name age     city
0  Samantha  35  Houston
1      Alex  17  Seattle

In [69]:
# returns the first two columns
students_df.iloc[:, 0:2]

       name age
0  Samantha  35
1      Alex  17
2     Dante  26

In [72]:
# returns first row and columns 1 and 2
students_df.iloc[0:1, 0:2]

       name age
0  Samantha  35

### How would we use `.iloc` to return the last item in the last row?

In [74]:
# return the last item in the last row using iloc
students_df.iloc[-1, -1]

'New york'

### How would we use `.iloc` to return the last item in the last column?

In [75]:
# return the last item in the last column using iloc
students_df.iloc[-1, -1]

'New york'

### What if we only want certain columns or rows?

In [76]:
# Don't do students_df.iloc[0, 2]
students_df.iloc[[0, 2]]

       name age      city
0  Samantha  35   Houston
2     Dante  26  New york

In [77]:
students_df.iloc[[0, 2], [0, 2]]

       name      city
0  Samantha   Houston
2     Dante  New york

### Let's take a look at `.loc`
#### Label based method. 
#### Names or labels of the index is used when taking slices.
#### Also supports boolean subsetting.

In [78]:
# We will use loc to return rows and columns based on labels. Let's look at the students_df DataFrame again.
students_df

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [79]:
# returns the student information associated with index 0
students_df.loc[0]

name    Samantha
age           35
city     Houston
Name: 0, dtype: object

In [80]:
# returns the student information for row index 0 to 2 inclusive.
# note iloc would return normal python slicing not including 2 as demonstrated above.
students_df.loc[0:2]
#loc includes 2, iloc excludes 2; loc doesn't know 2 is an integer

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [81]:
# returns the column labeled 'age'
students_df.loc[:, 'age']

0    35
1    17
2    26
Name: age, dtype: object

In [82]:
# returns the column labeled 'age' and index values 1 to 2.
# gives us the values of the rows with index from 1 to 2 (inclusive)
# and columns labeled age"
students_df.loc[1:2, 'age']

1    17
2    26
Name: age, dtype: object

In [83]:
# returns the column labeled 'age' and index values 1 to 2.
# gives us the values of the rows with index from 1 to 2 (inclusive)
# and columns labeled age to city (inclusive)"
students_df.loc[1:2, 'age':'city']

  age      city
1  17   Seattle
2  26  New york

In [84]:
# What should we get?
students_df.loc[1:2, ['name', 'city']]

    name      city
1   Alex   Seattle
2  Dante  New york

In [85]:
# How about?
students_df.loc[[0, 2], ['name', 'city']]

       name      city
0  Samantha   Houston
2     Dante  New york

In [87]:
# if index rearranged
school_ids = ['5', '11', '3']
students_df = pd.DataFrame(student_dict, index=school_ids)
students_df

        name age      city
5   Samantha  35   Houston
11      Alex  17   Seattle
3      Dante  26  New york

In [88]:
# What should we get now?
students_df.loc[[0, 2], ['name', 'city']]

KeyError: "None of [Int64Index([0, 2], dtype='int64')] are in the [index]"

In [89]:
# What should we get now?
students_df.loc[['5', '11'], ['name', 'city']]

        name     city
5   Samantha  Houston
11      Alex  Seattle

In [90]:
students_df.set_index("name", inplace=True)
students_df

         age      city
name
Samantha  35   Houston
Alex      17   Seattle
Dante     26  New york

In [91]:
students_df.loc[['Samantha']]

         age     city
name
Samantha  35  Houston

In [92]:
# Subsetting nonconsecutive rows
students_df.loc[['Samantha', 'Dante']]

         age      city
name
Samantha  35   Houston
Dante     26  New york

In [93]:
# Samantha to the end
students_df.loc['Samantha':]

         age      city
name
Samantha  35   Houston
Alex      17   Seattle
Dante     26  New york

In [94]:
# return the first and last rows using one loc command

### Boolean Subsetting

In [ ]:
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante', 'Samantha'],
    'age': ['35', '17', '26', '21'],
    'city': ['Houston', 'Seattle', 'New york', 'Atlanta'],
    'state': ['Texas', 'Washington', 'New York', 'Georgia']
}

students_df = pd.DataFrame(student_dict)

In [ ]:
# The statement data[name] == Samantha] produces a Pandas Series with a True/False value for every row
# in the data DataFrame, where there are True values for the rows where the name is Samantha.
# These type of boolean arrays can be passed directly to the .loc indexer.
students_df.loc[students_df['name'] == 'Samantha']

In [ ]:
# What about if we only want the city and state of the selected students with the name Samantha?
students_df.loc[students_df['name'] == 'Samantha', ['city', 'state']]

In [ ]:
# What amount if we want to select a student of a specific age?
students_df.loc[students_df['age'] == '21']

In [ ]:
# What amount if we want to select a student of a specific age?
students_df.loc[(students_df['age'] == '21') &
                (students_df['city'] == 'Atlanta')]

In [ ]:
# What should be returned?
students_df.loc[(students_df['age'] == '35') &
                (students_df['city'] == 'Atlanta')]

### Lesson Recap
Pandas combines the power of python lists (selection via integer location) and dictionaries (selection by label)

`.iloc` is primarily integer position based (from 0 to length-1 of the axis), but may also be used with a boolean array.

`.iloc` will raise IndexError if a requested indexer is out-of-bounds, except slice indexers which allow out-of-bounds indexing (this conforms with python/numpy slice semantics).

`.loc` is primarily label based, but may also be used with a boolean array.

#### Warning Note that contrary to usual python slices, both the start and the stop are included.

`.loc` will raise a keyError when any items are not found.

### Pandas
- The data structures in Pandas are implemented using series and dataframe classes.  
- A series is a one-dimensional indexed array of some fixed data type.  
- While a dataframe is a two-dimensional data structure like a table where each column contains data of the same type.  
- DataFrames are great for representing real data: rows correspond to instances (examples, observations, etc.), and columns correspond to features of these instances.

### CLASS ASSIGNMENT
Now that we have all of these new tools in our tool belt, use these tools on the shelter data set! 
- Use `shelter_data.columns` to get the list of column names.
- Subset the data by '`Outcome Subtype`.
- Subset the data by '`Outcome Subtype` `Adoption` and only return the `Animal Type` column. 
- Subset the data by '`Outcome Subtype` `Adoption` and only return the `Animal Type` column with only `Cat`. 
- Play around with your new tools on the data set.
- For extra credit: What are the data types returned from the different subsetting? Is what returned a series or dataframe?

In [ ]:
import pandas as pd
shelter_data = pd.read_csv(
    'https://data.austintexas.gov/api/views/9t4d-g238/rows.csv?accessType=DOWNLOAD')
shelter_data.head()

## Assessment & Reflection

- One thing you did not know before?
- Two things you want to remember?
- One thing you're still confused by?